<h2>Stored Procedures</h2>

In [1]:
import pymysql

In [2]:
%load_ext sql
%sql mysql+pymysql://root:eitapreulasql@127.0.0.1:3306

In [5]:
%%sql
use petshop;
select database();

 * mysql+pymysql://root:***@127.0.0.1:3306
0 rows affected.
1 rows affected.

[('petshop',)]

In [6]:
%sql show tables;

 * mysql+pymysql://root:***@127.0.0.1:3306
2 rows affected.

[('petrescue',), ('petsale',)]

Let's create a stored procedure named retrieve all. It will contain contain a query to retrieve all the records from petsale. This is good because we don't need to rewrite the same query over and over again

In [34]:
%%sql
drop procedure if exists retrieve_all;

 * mysql+pymysql://root:***@127.0.0.1:3306
0 rows affected.

[]

In [35]:
%%sql
create procedure retrieve_all()
begin
   select *  from petsale;
END;

 * mysql+pymysql://root:***@127.0.0.1:3306
0 rows affected.

[]

In [19]:
%%sql
call retrieve_all

 * mysql+pymysql://root:***@127.0.0.1:3306
5 rows affected.

[(1, 'Cat', Decimal('450.09'), datetime.date(2018, 5, 29), 9),
 (2, 'Dog', Decimal('666.66'), datetime.date(2018, 6, 1), 3),
 (3, 'Parrot', Decimal('50.00'), datetime.date(2018, 6, 4), 2),
 (4, 'Hamster', Decimal('60.60'), datetime.date(2018, 6, 11), 6),
 (5, 'Goldfish', Decimal('48.48'), datetime.date(2018, 6, 14), 24)]

Now we are going to create a stored procedure routine named update_saleprice with parameters animal_id and animal_health

This routine will contain SQL queries to update the sale price of the animals in the petsale table depending on their health condition, bad or worse.

This procedure routine will take animal ID and health condition as parameters which will be used to upate the sale price of animal in the PETSALE table by an amount depending on their health condition:
1. For animal with ID XX  having BAD health codintion, the sale price will be reduced further by 25%;
2. For animal with ID YY having WORSE health condition, the sale price will be reduced further by 50%;
3. For animal with ID ZZ having other health condition, the sale price won't change.

In [32]:
%%sql 
create procedure update_saleprice (
    in animal_id integer, in animal_health varchar(5)
)
begin
    if animal_health = 'BAD' then 
        update petsale
        set saleprice = saleprice - (saleprice * 0.25)
        where id = animal_id;
    elseif animal_health = 'WORSE' then
        update petsale
        set saleprice = saleprice  - (saleprice * 0.5)
        where id = animal_id;
    else
        update petsale
        set saleprice = saleprice
        where id = animal_id;
    end if;
end

 * mysql+pymysql://root:***@127.0.0.1:3306
0 rows affected.

[]

Let's call the update_saleprice routine.

We want to update the sale price of animal with id 1 having BAD health condition in the PETSALE table.

In [36]:
%%sql

call retrieve_all;

call update_saleprice(1, 'BAD');

call retrieve_all;

 * mysql+pymysql://root:***@127.0.0.1:3306
5 rows affected.
1 rows affected.
5 rows affected.

[(1, 'Cat', Decimal('337.57'), datetime.date(2018, 5, 29), 9),
 (2, 'Dog', Decimal('666.66'), datetime.date(2018, 6, 1), 3),
 (3, 'Parrot', Decimal('50.00'), datetime.date(2018, 6, 4), 2),
 (4, 'Hamster', Decimal('60.60'), datetime.date(2018, 6, 11), 6),
 (5, 'Goldfish', Decimal('48.48'), datetime.date(2018, 6, 14), 24)]

In [37]:
%%sql
select * from petsale;

 * mysql+pymysql://root:***@127.0.0.1:3306
5 rows affected.

[(1, 'Cat', Decimal('337.57'), datetime.date(2018, 5, 29), 9),
 (2, 'Dog', Decimal('666.66'), datetime.date(2018, 6, 1), 3),
 (3, 'Parrot', Decimal('50.00'), datetime.date(2018, 6, 4), 2),
 (4, 'Hamster', Decimal('60.60'), datetime.date(2018, 6, 11), 6),
 (5, 'Goldfish', Decimal('48.48'), datetime.date(2018, 6, 14), 24)]

In [38]:
%%sql

call retrieve_all;

call update_saleprice(3, 'WORSE');

call retrieve_all;

 * mysql+pymysql://root:***@127.0.0.1:3306
5 rows affected.
1 rows affected.
5 rows affected.

[(1, 'Cat', Decimal('337.57'), datetime.date(2018, 5, 29), 9),
 (2, 'Dog', Decimal('666.66'), datetime.date(2018, 6, 1), 3),
 (3, 'Parrot', Decimal('25.00'), datetime.date(2018, 6, 4), 2),
 (4, 'Hamster', Decimal('60.60'), datetime.date(2018, 6, 11), 6),
 (5, 'Goldfish', Decimal('48.48'), datetime.date(2018, 6, 14), 24)]